class String_manager {
  static const String diets_instructions = '''
1-	المشى نصف ساعه يوميا مشى سريع متواصل
2-	المشى قبل الاكل ب نصف ساعه او بعد الاكل بساعتين  
3-	شرب 2 كوب ماء قبل كل وجبه ب ربع ساعه وبعدها ب ربع ساعه
4-	شرب 15 كوب ماء على مدار اليوم 
5-	تثبيت مواعيد الاكل والالتزام بها 
6-	اكل 5 واجبات يوميا حسب النظم المخصص 
7-	التمارين مهمه للتخلص من الدهون لحرق الدهون وشد الجسم
8-	الموالح ممنوعه تماما (مثل / المخلل الملوحه والملح الكثير فى الاكل)
9-	السكر تقليل قدر المستطاع على الاكثر 3 معالق يوميا 
10-	المشروبات المتاحه ( القرفه – الجنزبيل -الكمون – الليمون -الشاى الاخصر -القهوه -النسكافيه الساده -النسكافيه بلبن منزوع الدسم -اللبن منزوع الدسم -  )
11-	المشاريب بواقع 2او 3 يوميا 
''';
  static const String diets_1200_cals = '''
الفطار الساعه 9 صباحا 
نصف رغيف مصرى + 2 كوب زبادى
او نصف رغيف مصرى + بيضه مسلوقه
او نصف رغيف مصرى + 2 معلقه جبن قريش
او 8 معالق شوفان باللبن منزوع الدسم 
طبق بليله قمح مع باللبن منزوع الدسم

سناكس الساعه 12 ظهرا
1 ثمره فاكهه (تفاح – موز – برتقال – يوسفى – جوافه – كمثرى - خوخ )
او نصف ثمره شهد
او 4 ثمرات فروله
او شريحه بطيخ
الغدا الساعه 3 ظهرا 
طبق سبطه +طبق خضار + رغيف مصرى + ربع فرخه مسلوقه او مشويه او قطعه لحم مسلوقه او مشويه 
(الخضار يشمل / كوسه – باميه – فاصوليا -بسله -بطاطس – ملوخيه )
او طبق سبطه +1 سمكه مشويه + رغيف مصرى
او طبق سبطه +علبه تونه بدون زيت + رغيف مصرى
او طبق سبطه + طبق عدس او فول + رغيف مصرى

سناكس الساعه 6 مساء
1 ثمره فاكهه
العشاء الساعه 9 مساء
3 ثمرات فاكهه
''';
  static const String diets_1400_cals = '''
الفطار الساعه 9 صباحا 
نصف رغيف مصرى + 2 كوب زبادى
او نصف رغيف مصرى + بيضه مسلوقه
او نصف رغيف مصرى + 2 معلقه جبن قريش
او 8 معالق شوفان باللبن منزوع الدسم 
طبق بليله قمح مع باللبن منزوع الدسم

سناكس الساعه 12 ظهرا
1 ثمره فاكهه (تفاح – موز – برتقال – يوسفى – جوافه – كمثرى - خوخ )
او نصف ثمره شهد
او 4 ثمرات فروله
او شريحه بطيخ
الغدا الساعه 3 ظهرا 
طبق سبطه +طبق خضار + رغيف مصرى + ربع فرخه مسلوقه او مشويه او قطعه لحم مسلوقه او مشويه 
(الخضار يشمل / كوسه – باميه – فاصوليا -بسله -بطاطس – ملوخيه )
او طبق سبطه +1 سمكه مشويه + رغيف مصرى
او طبق سبطه +علبه تونه بدون زيت + رغيف مصرى
او طبق سبطه + طبق عدس او فول + رغيف مصرى

سناكس الساعه 6 مساء
2 ثمره فاكهه
العشاء الساعه 9 مساء
مثل الفطار 
''';
  static const String diets_1600_cals = '''
الفطار الساعه 9 صباحا 
رغيف مصرى + 2 كوب زبادى
او رغيف مصرى + بيضه مسلوقه
او رغيف مصرى + 2 معلقه جبن قريش
او 8 معالق شوفان باللبن منزوع الدسم 
طبق بليله قمح مع باللبن منزوع الدسم

سناكس الساعه 12 ظهرا
1 ثمره فاكهه (تفاح – موز – برتقال – يوسفى – جوافه – كمثرى - خوخ )
او نصف ثمره شهد
او 4 ثمرات فروله
او شريحه بطيخ
الغدا الساعه 3 ظهرا 
طبق سبطه +طبق خضار + رغيف مصرى + ربع فرخه مسلوقه او مشويه او قطعه لحم مسلوقه او مشويه 
(الخضار يشمل / كوسه – باميه – فاصوليا -بسله -بطاطس – ملوخيه )
او طبق سبطه +1 سمكه مشويه + رغيف مصرى
او طبق سبطه +علبه تونه بدون زيت + رغيف مصرى
او طبق سبطه + طبق عدس او فول + رغيف مصرى

سناكس الساعه 6 مساء
2 ثمره فاكهه
العشاء الساعه 9 مساء
مثل الفطار + نصف رغيف مصرى
''';
  static const String diets_1800_cals = '''
الفطار الساعه 9 صباحا 
رغيف مصرى + 2 كوب زبادى
او رغيف مصرى + بيضه مسلوقه
او رغيف مصرى + 2 معلقه جبن قريش
او 10 معالق شوفان باللبن منزوع الدسم 
طبق بليله قمح مع باللبن منزوع الدسم

سناكس الساعه 12 ظهرا
2 ثمره فاكهه (تفاح – موز – برتقال – يوسفى – جوافه – كمثرى - خوخ )
او نصف ثمره شهد
او 4 ثمرات فروله
او شريحه بطيخ
الغدا الساعه 3 ظهرا 
طبق سبطه +طبق خضار + رغيف مصرى + ربع فرخه مسلوقه او مشويه او قطعه لحم مسلوقه او مشويه 
(الخضار يشمل / كوسه – باميه – فاصوليا -بسله -بطاطس – ملوخيه )
او طبق سبطه +1 سمكه مشويه + رغيف مصرى
او طبق سبطه +علبه تونه بدون زيت + رغيف مصرى
او طبق سبطه + طبق عدس او فول + رغيف مصرى

سناكس الساعه 6 مساء
2 ثمره فاكهه
العشاء الساعه 9 مساء
مثل الفطار + رغيف مصرى
''';
  static const String diets_2000_cals = '''
الفطار الساعه 9 صباحا 
رغيف مصرى + 2 كوب زبادى
او رغيف مصرى + بيضه مسلوقه
او رغيف مصرى + 2 معلقه جبن قريش
او 12 معالق شوفان باللبن منزوع الدسم 
طبق بليله قمح مع باللبن منزوع الدسم

سناكس الساعه 12 ظهرا
2 ثمره فاكهه (تفاح – موز – برتقال – يوسفى – جوافه – كمثرى - خوخ )
او نصف ثمره شهد
او 4 ثمرات فروله
او شريحه بطيخ
الغدا الساعه 3 ظهرا 
طبق سبطه +طبق خضار + رغيف ونص مصرى + ربع فرخه مسلوقه او مشويه او قطعه لحم مسلوقه او مشويه 
(الخضار يشمل / كوسه – باميه – فاصوليا -بسله -بطاطس – ملوخيه )
او طبق سبطه +2 سمكه مشويه + رغيف ونص مصرى
او طبق سبطه +علبه تونه بدون زيت + رغيف ونص مصرى
او طبق سبطه + طبق عدس او فول + رغيف ونص  مصرى

سناكس الساعه 6 مساء
2 ثمره فاكهه
العشاء الساعه 9 مساء
الاكل مثل الفطار + رغيف مصرى
''';
  static const String diets_2200_cals = '''
الفطار الساعه 9 صباحا 
رغيف مصرى + 2 كوب زبادى
او رغيف مصرى + بيضه مسلوقه
او رغيف مصرى + 2 معلقه جبن قريش
او 12 معالق شوفان باللبن منزوع الدسم 
طبق بليله قمح مع باللبن منزوع الدسم

سناكس الساعه 12 ظهرا
2 ثمره فاكهه (تفاح – موز – برتقال – يوسفى – جوافه – كمثرى - خوخ )
او نصف ثمره شهد
او 4 ثمرات فروله
او شريحه بطيخ
الغدا الساعه 3 ظهرا 
طبق سبطه +طبق خضار +2 رغيف مصرى + ربع فرخه مسلوقه او مشويه او قطعه لحم مسلوقه او مشويه 
(الخضار يشمل / كوسه – باميه – فاصوليا -بسله -بطاطس – ملوخيه )
او طبق سبطه +2 سمكه مشويه +2  رغيف مصرى
او طبق سبطه +علبه تونه بدون زيت +2  رغيف مصرى
او طبق سبطه + طبق عدس او فول + 2 رغيف مصرى

سناكس الساعه 6 مساء
2 ثمره فاكهه
العشاء الساعه 9 مساء
الاكل مثل الفطار + رغيف مصرى
''';
  static const String diets_children = '''
وجبة الإفطار: في جميع الأيام تعتبر نظام الغذائي لوجبة الإفطار واحدة وهي عبارة عن ( بيضة مسلوقة بجانب قطعة من الجبن الشيدر أو الجبن المثلثات بجانب نصف خبز أسمر أو تناول 4 ملاعق من الفول بالزيت الزيتون بجانب نصف خبز سن بجانب حليب نصف دسم أو تناول كوب حليب نصف دسم بجانب 5 ملاعق من الكورن فليكس وثمرة من التفاح أو الخيار.
وجبة إضافية بعد مرور ساعتين: كوب من العصير الطازج بدون إضافة سكر أو تناول ثمرة من الفاكهة.
اليوم الأول
وجبة الغداء: تناول قطعة من اللحم المسلوقة أو المشوية بجانب 5 ملاعق من المكرونة بالإضافة طبق من السلطة.
اليوم الثاني
وجبة الغداء: 5 ملاعق من الأرز بجانب 4 أصابع من الكفتة المشوية وطبق من الخضار السوتية.
اليوم الثالث
وجبة الغداء: تناول طبق من التونة بمحلول مائي مصفاة جيدا بجانب طبق من السلطة ونصف خبز أسمر.
اليوم الرابع
وجبة الغداء: ربع دجاجة مشوية ومخلية من الجلد بجانب طبق من شوربة الخضار و3 ملاعق من الأرز وطبق سلطة.
اليوم الخامس
وجبة الغداء: صدور دجاج مشوية مخلية من الجلد و3 ملاعق مكرونة وطبق سلطة وبطاطس بيورية.
اليوم السادس
وجبة الغداء: رغيف سن بجانب ثمرة خيار وطماطم وقطعة من الهمبورجر.
وجبة إضافية بين الغداء والعشاء: طبق من سلطة الفاكهة أو العصير الطازج أو 4 حبات من المكسرات.
وجبة العشاء: وجبة ثابتة تناول الزبادي الخالي من الدسم مع 3 ثمرات من البرتقال أو كوب من الحليب نصف دسم مع 3 حبات من التمر.
نظام رجيم للأطفال الثاني
وجبة الإفطار: تناول طبق كورن فليكس مع حليب نصف دسم وتحليته بعسل النحل.
وجبة المدرسة: تناول ساندوتش مكون من (شريحتين من التوست بداخلهم شريحة دجاج ومع شريحة جبنة شيدر وقطعة من الطماطم والخيار) بجانب عصير فريش بدون سكر.
وجبة الغداء: تناول بطاطس مشوية في الفرن بجانب قطعة من الدجاج المشوي و4 ملاعق من الأزر وطبق السلطة أو تناول شريحة من اللحم المشوي أو 5 صوابع من الكفتة بجانب الخضار السوتية أو المسلوق.
وجبة إضافية: تناول طبق من سلطة الفاكهة أو 3 حبات من البسكوت القمح أو 4 حبات من المكسرات (اللوز أو البندق أو الكاجو أو الجوز).
وجبة العشاء: تناول كوب من الحليب بجانب 3 حبات من التمر أو تناول الزبادي بجانب 3 حبات من البرتقال أو الجريب فروت .


''';
  static const String diets_Thin = '''
وجبة الإفطار
•	البيض المقلي بالدهون الصحية مثل الزبدة الطبيعية مع الجبن الكريمي وكوب من اللبن كامل الدسم مع العسل الأبيض وربع كوب من المكسرات والفواكه المجففة.
•	توست من الخبز البني من زبدة الفول السوداني والعسل الأبيض الطبيعي مع كوب من مشروب الشيكولاتة الدافئة باللبن كامل الدسم مع ثمرة فاكهة كبيرة مثل: الكمثرى، المانجو.
•	بذور الشيا مع خبز الشوفان وكوب كبير من اللبن كامل الدسم مع فاكهة مثل الموز ونصف كوب من المكسرات والزبيب وهذه من أفضل وجبات في نظام غذائي لعلاج النحافة .
•	أومليت من البيض والبطاطا مع كوب من مخفوق اللبن بالفاكهة والعسل الأبيض.
•	بيض مع المشروم وثمرة الأفوكادو مع كوب من اللبن والخبز المصنوع من دقيق القمح الكامل .
•	توست يحتوي على زبدة أو مربى مع الفاكهة مثل التوت وبذور الشيا مع كوب لبن كامل الدسم محلى بالعسل مع الفواكه المجففة.
•	البيض المقلي بالسمن مع المشروم والسبانخ مع الخبز واللبن وثمرة فاكهة.
وجبة الغذاء
•	شرائح الدجاج مع صحن السلطة الخضراء و الأفوكادو والعسل الأبيض والمكرونة المعدة بزيت الزيتون مع إضافة الجبن المبشور لزيادة سعرات الوجبة.
•	سمك السالمون مع الخضراوات بزيت السمسم وبذور السمسم مع الحمص والخبز والسلطة ويجب إدراجه في نظام غذائي لعلاج النحافة وتقوية المناعة.
•	معكرونة بالجبن وزيت الزيتون مع مكعبات اللحم وطبق من السلطة الخضراء بزيت السمسم والأفوكادو.
•	سمك التونة بالزيت وسلطة الخضروات والسبانخ والطماطم والشطة والخل مع الخبز.
•	مكعبات البطاطس مع لحم الضأن والخضراوات المطهية بزيت الزيتون والبهارات والأرز البني.
وجبة العشاء
•	سلطة الدجاج مع قطع الخبز المحمص بالزيت مع الخس وكوب زبادي كامل الدسم.
•	ساندويش من الجبن مع البيض المقلي بالسمن الطبيعي مع ثمرة أفوكادو الغنية بالدهون الصحية مع صحن من السلطة الخضراء وعيش التورتيلا.
•	شوربة المشروم وقطع الدجاج و السبانخ بالكريمة والجبن المبشور.
•	قطع البطاطس مع كوب من الزبادي كامل الدسم بالعسل الأبيض مع ربع كوب من الفاكهة المجففة والمكسرات.
الوجبات الخفيفة خلال اليوم
•	زبادي كامل الدسم محلى بعسل النحل الطبيعي مع المكسرات وبذور الشيا.
•	موز مع خبز التوست مع زبدة الفول السوداني والجبن الكريمي.
•	فاكهة مع كوب لبن كامل الدسم مع المكسرات.
•	جبن كريمي مع التونة بالزيت و الخس والخبز البني.
•	زبدة الفول السوداني والعسل الأبيض والمكسرات.
•	ثمرة الأفوكادو مع عسل النحل.

''';
  static const String diets_Thin_advice = '''
أن التخلص من النحافة لا يعني تناول الأطعمة غير الصحية والدسمة بالدهون غير المفيدة والمقليات أو المياه الغازية لأنها تضر الجسم وتضعف المناعة بشدة مع زيادة محيط الدهون في الجسم وانسداد الشرايين وزيادة نسبة الإصابة بمرض السكري النوع الثاني.
لذا يتطلب علاج النحافة اتباع نظام غذائي لزيادة الوزن و نظام غذائي لعلاج النحافة بصحة ويجب زيادة كميات الطعام التي يتناولها الفرد في الوجبات وتناول الأطعمة مرتفعة السعرات الحرارية.
ويجب فهم آلية عمل الجسم في العمل لاكتساب الوزن بسهولة إذ يجب على مريض النحافة تناول سعرات حرارية أكثر من معدل حرق الجسم للسعرات خلال اليوم حتى يزيد الوزن ويتخلص من النحافة تماماً وإليك أفضل نظام غذائي لعلاج النحافة بسهولة وصحة:
•	تناول الكربوهيدرات والبروتين مع الدهون الصحية فى جميع الوجبات يومياً.
•	زيادة عدد الوجبات الرئيسية إلى خمس وجبات بدلاً من ثلاث وجبات يومياً.
•	يجب تناول وجبات خفيفة تحتوي على دهون صحية أثناء اليوم لزيادة عدد السعرات الحرارية اليومية مثل: زبدة الفول السوداني، والمكسرات، والأفوكادو.
•	الحرص على تناول البقوليات مثل الفول، والعدس، واللوبيا فى الأسبوع 3 مرات على الأقل لأنها غنية بالبروتين الهام لزيادة الوزن وذلك أفضل نظام غذائي لعلاج النحافة .
•	شرب الألبان كاملة الدسم يومياً ويفضل تناول التمر المنقوع في اللبن يومياً ويمكن إضافة المكسرات والعسل الأبيض والفواكه المجففة.
•	من أسرع الأطعمة لزيادة الوزن وعلاج النحافة الفواكه المجففة مثل الزبيب، والبرقوق المجفف، والمشمش المجفف، والمكسرات غير المملحة، والافوكادو، وزبدة الفول السوداني، والتمر، والبذور.
•	إضافة الدهون الصحية للطعام أثناء تحضيره مثل زيت جوز الهند، وزيت السمسم، و الزبدة الطبيعية،  والقشطة الطبيعية.
•	تناول البيض يومياً في الفطور لأنه مصدر هام للبروتين وبناء عضلات الجسم وبالتالي زيادة الوزن و يفضل تناول البروتين حيواني المصدر مثل: اللحوم الحمراء، والدجاج ونسبة البروتين اليومية لعلاج النحافة هي 1:1.6 جرام بروتين لكل كيلوجرام من وزن الشخص.
•	تناول الأسماك الدسمة الزيتية مرتين أسبوعياً على الأقل مثل الماكريل، وسمك التونة، وسمك السالمون، البوري لأنه غني بالأوميجا3 المفيدة للجسم وترفع من مناعته ومقاومته للأمراض ومن أهم نصائح في نظام غذائي لعلاج النحافة .
•	الحرص على تناول جميع العناصر الغذائية لتوفير كافة أنواع الفيتامينات والمعادن الهامة للجسم لتقوية المناعة والتخلص من النحافة بصحة.
•	الحرص على تناول الخضراوات ذات الأوراق الداكنة مثل: السبانخ.
•	تناول الفاكهة الغنية بالسعرات على مدار اليوم مثل: الموز، التين، البلح، المانجو، التوت.
•	إدراج الكربوهيدرات بكميات كبيرة وخاصة المصنعة من الحبوب الكاملة مثل الأرز البني، والمعكرونة ومخبوزات القمح الكامل.
•	الحرص على تناول مشتقات اللبن كامل الدسم مثل الزبادي كامل الدسم والجبن الكريمي الدسم والقشطة الطبيعية.
•	ممارسة التمارين الرياضية مع اتباع نظام غذائي لعلاج النحافة لزيادة الكتلة العضلية واكتساب الوزن.

''';
  static const String diets_pregnant_advice = '''
لماذا يعد النظام الغذائي الصحي المتوازن مهماً جداً أثناء الحمل؟
اتباع نظام غذائي للحامل أمراً بالغ الأهمية للحفاظ على صحة جيدة وخصوصاً أثناء الحمل، ويمثل الحصول على التغذية الصحيحة هي واحدة من أفضل الطرق بتزويد طفلكِ ما يحتاجه في بداية حياته، ويجب أن يتضمن النظام الغذائي للحامل مجموعة من الأطعمة الصحية من كل فئات المجموعة الغذائية والتي تشمل الحبوب الكاملة والخضروات والفواكه والبروتينات كالسمك والدجاج واللحم الأحمر والبقوليات ومنتجات الألبان قليلة الدسم والغنية بالكالسيوم والتي تمثل جميعها مكونات أساسية من التغذية الصحية للحامل.
لا تتناولي كميات كبيرة من الطعام، تناولي الطعام الصحي
يحتاج جسمك في هذه الفترة إلى عناصر غذائية إضافية لدعم نمو طفلكِ وتطوره،ولكن هذا لا يعني بالضرورة تناول كميات أكبر من الطعام. يصبح جسمك أكثر كفاءة في امتصاص العناصر الغذائية أثناء الحمل والذي يسمح لبدء بناء مخزون من الفيتامينات والمعادن الضرورية، وهذا يعني أن جسمك يحقق بشكل طبيعي المستويات المطلوبة من التغذية لكِ ولطفلكِ دون الحاجة إلى زيادة كمية الطعام.
الجدول الغذائي للثلث الأول
يجب أن يكون النظام الغذائي للحامل في الأشهر الثلاثة الأولى من الحمل غنياً بحمض الفوليك المهم جداً لنمو الجهاز العصبي لطفلكِ.وتعد البروكلي والسبانخ والحمضيات والهليون والبقوليات والبازلاء والعدس والأفوكادو والبذور والمكسرات والجزر والكرفس كلها مصادر هامة لحمض الفوليك. الحديد أيضاً مهم خلال الفترة الأولى من الحمل ويمكن الحصول عليه من اللحوم الحمراء والدجاج والفواكه المجففة (المشمش والخوخ) والحبوب المدعمة بالحديد والسمك. وفي حال لم تكن البروتينات الحيوانية موجودة في نظامك الغذائي، يمكنك الحصول على الحديد من البقوليات والخضروات والحبوب المدعمة بالحديد.
سوف نعرض عليك طريقة إضافة هذه المكونات إلى الشوربات والسلطات و السندويتشات والوجبات الخفيفة في مخطط نظام غذائي للحامل في المرحلة الأولى من الحمل.
الجدول الغذائي للثلث الثاني
خلال الثلث الثاني من الحمل ، الوجبات الغذائية الغنية بالكالسيوم والمغنيسيوم وفيتامين “د” والأحماض الدهنية أوميجا 3 ، تلعب الآن دوراً كبيراً كجزء من النظام الغذائى للحامل. حيث تساعد هذه العناصر الغذائية في نمو عظام وأسنان طفلك بطريقة سليمة، في حين ينظم الفيتامين “د” مستويات الكالسيوم والفوسفات في الجسم ، مما يساعد على الحفاظ على صحة عظامك وأسنانك. بينما تلعب الأحماض الدهنية أوميجا 3 دوراً جوهرياً في تطور البصر والدماغ عند الطفل. ونذكر هنا بعض الأطعمة الغنية بالفيتامين “د” وأوميجا 3 والكالسيوم والمغنيسيوم والتي يجب تناولها في المرحلة الثانية (الثلث الثاني من الحمل):
•	سمك السلمون والماكريل والأسماك الزيتية الأخرى مثل سمك التونا والسردين وكذلك زيت كبد الحوت.
•	البيض ومنتجات الألبان.
•	البروكلي والبامية والبقوليات والعدس واللوز.
•	الأفوكادو والتين والموز والسبانخ.
يحدد مخطط النظام الغذائي للحامل في الثلث الثاني من الحمل بعض الأطباق سهلة التحضير والتي تتضمن العناصر الغذائية التي تحتاجينها في المرحلة الثانية من الحمل.
الجدول الغذائي للثلث الثالث
خلال الثلث الثالث والأخير من الحمل ، ينمو طفلكِ بسرعة،حيث تنمو العينان والعظام والأعضاء الداخلية والدماغ والرئتان مما يزيد من احتياجاتهم الغذائية، بالإضافة إلى هذا النمو السريع، فإن جسمك يستعد للولادة. وبالتالي إتباع نظام غذائي صحي للحامل مليئاً بالعناصر الغذائية الضرورية هو بنفس القدر من الأهمية الآن كما كان فى الثلث الأول والثاني من الحمل.
بالإضافة إلى احتياجاتك الغذائية الأساسية ، سوف تحتاجين إلى 200 – 300 سعر حراري إضافي يومياً خلال الثلث الثالث من الحمل.
ما هي الأغذية التي تؤمن لكِ 200-300 سعر حراري إضافي في اليوم؟
نذكر لك فيما يلي بعض الأغذية التي يمكنك تناولها لزيادة كمية السعرات الحرارية، وتوجد العديد من الأطعمة الصحية الأخرى التي يمكنك تناولها، ولكن تأكدي من أنها لا تزيد كمية السعرات التي تتناولينها أكثر من اللازم.
•	تفاحة متوسطة، نصف كوب من الجزر، نصف كوب من الكرفس وملعقة كبيرة من زبدة الفول السوداني الطبيعية أو العضوية.
•	حبة موز متوسطة و3/4 كوب من الجبن المبستر قليل الدسم.
•	خبز بيتا مع حمص قليل الدسم وجزر مبشور.
•	حبتان متوسطتان من المانجا.
•	لبن (زبادي) قليل الدسم مع المكسرات أو الفواكه.
ويمكن زيادة كمية السعرات الحرارية عن طريق إضافة اللوز أو التفاح أو المشمش المجفف أو غيرها من الفواكه والمكسرات والخضروات الطازجة إلى الاقتراحات المذكورة أعلاه.
وتذكري دائماً أن جسمك يتأقلم مع الحمل ويمتص المزيد من الكالسيوم من الطعام الذي تتناولينه بهدف تقوية عظام طفلكِ، مما يعني أنك لا تحتاجين إلى تناول كميات أكبر من الطعام وإنما يجب التركيز على الأطعمة الغنية بالكالسيوم. وتتضمن مصادر الكالسيوم الجيدة إلى جانب مشتقات الحليب وخلافها، الخضروات ذات الأوراق الخضراء الداكنة مثل البروكلي والكرنب واللفت والبامية، وسمك السلمون والسردين واللوز، والمشمش والتين المجفف وحبوب السمسم والفاصولياء البيضاء وعصير البرتقال المدعم.
حاولي تناول كوبين من الفواكه و3 أكواب من الخضروات و8 أوقية ( أي حوالي 226 جرام) من خبز الحبوب الكاملة يومياً ، و ستحتاجين إلى 6.5 أوقية ( أى حوالى 184 جرام ) من البروتين مثل اللحوم الخالية من الدهون أو لحم الدواجن أو البقوليات أو المكسرات أو البيض كل يوم مع 3 أكواب من الحليب أو الزبادي قليل الدسم.
وتساعدك الوجبات الموجودة في مخطط النظام الغذائي الصحي للحامل – في الثلث الثالث من الحمل من تحقيق ذلك.
الأطعمة التي يجب تجنبها خلال الحمل
إليك دليل بسيط حول بعض الأطعمة التي يجب تجنبها أثناء الحمل والتي قد تشكل خطراً محتملاً على طفلكِ:
•	اللحوم والأسماك والدجاج النيء أو المطهي جزئياً، لأنها قد تحتوي على بكتيريا السالمونيلا المضرة بطفلكِ.
•	البيض النيء أو غير المطبوخ جيداً: والأطعمة المصنوعة من البيض النيئ أيضاً (مثل المايونيز وبعض أنواع الآيس كريم والأطعمة منزلية الصنع).
•	منتجات الألبان غير المبسترة.
•	الكبدة والمنتجات المصنوعة منها.
•	الأسماك التي تحتوي على مستويات عالية من الزئبق مثل سمك القرش، سمك أبو سيف وسمك التونة (ذات العين الكبيرة)، إذ يؤدي استهلاك الزئبق خلال الحمل بتأخر النمو وتلف الدماغ للطفل.
•	المأكولات البحرية المدخنة لأنها قد تحتوي على بكتيريا الليستريا.
•	ينصح باستهلاك ما لا يزيد عن 200 ملغ من الكافيين في اليوم، بمقدار كوبين من القهوة أو الشاي ويوجد الكافيين في القهوة والشاي وبعض أنواع المشروبات الغازية والشوكولا.
تذكري استشارة الطبيبة في حال راودتك الشكوك حول الأطعمة التي ينبغي تناولها أو تجنبها خلال الحمل.
المكملات الغذائية: هل يجب تناولها أم لا؟
بعض العناصر الغذائية يصعب الحصول عليها من الطعام مقارنة بأخرى، فعلى سبيل المثال، يعد الفيتامين “د” عنصراً غاية في الأهمية لنمو العظام، ويمكن الحصول عليه من صفار البيض والأسماك الزيتية وحبوب الإفطار المدعمة بالفيتامين “د”، إلى جانب تعرض البشرة لأشعة الشمس الطبيعية ، ويجب توخي الحذر من الوقت الذي نتعرض فيه لأشعة الشمس المباشرة خصوصاً في البلدان ذات الطقس الحار، إذ قد يؤدي الإفراط في التعرض لأشعة الشمس إلى ظهور علامات التصبّغ خصوصاً أثناء الحمل. ننصحك باستشارة طبيبتك حول المدة التي يمكنك قضاؤها تحت الشمس من باب الاحتياط.
تساعد المكملات الغذائية على زيادة كمية الفيتامين “د” التي تحتاجينها ،ولكن قبل أن تقررى تناولها ، يجب استشارة الطبيبة أولاً.


''';
  static const String diets_pregnant_f3 = '''

وجبة الفطار
•	السبت  كوب من الحبوب المعززة بالحديد + كوب حليب قليل الدسم + معلقة كبيرة من الفواكه المجففة المفرومة
•	الاحد  بيضة مسلوقة + جبن مبستر + شريحتان من الخبز البني + ½ كوب من الخضراوات الطازجة
•	الاثنين  كوب من الشوفان المعزز بالحديد + كوب حليب + ¼ كوب فستق
•	الثلاثاء  جبن مبستر قليل الدسم + شرائح الطماطم والخيار + شريحة خبز بني
•	الاربعاء  كوب من حبوب القمح الكامل + كوب من الحليب +½ كوب من سلطة الفواكه
•	الخميس  منقوشة زعتر من حبوب القمح الكاملة منزلية الصنع + كوب حليب قليل الدسم +½ كوب من سلطة الفواكه
•	الجمعة  2-3 قطع من الفلافل الصغيرة + شريحتان من الخبز البني + شرائح الخضار + بيضة مسلوقة

وجبة خفيفة
•	السبت  كوب زبادي + حفنة من المكسرات + موزة
•	الاحد  كوب من سلطة الفواكه + ثمرة أفوكادو
•	الاثنين   ½كوب من التوت الطازج (الفراولة والتوت)
•	الثلاثاء  كوب من عصير البرتقال + ¼ كوب من الفواكه المجففة
•	الاربعاء  شرائح الخيار والجزر + ثمرة أفوكادو
•	الخميس  طبق من حساء الخضار (الفلفل الأخضر والسبانخ والطماطم وغيرها …)  
•	الجمعة  ½ كوب من البابايا والخوخ + كوب زبادي

وجبة الغذاء
•	السبت  60  غرام من صدور الدجاج المشوية + كوب من المكرونة مع صلصة الطماطم + ½ طبق تبولة
•	الاحد  60  غرام من التونة المشوية + شريحتان من الخبز البني + كوب من الخضار المشوي + ½ كوب حمص
•	الاثنين   60  غرام من لحم البقر المشوي + ½ كوب أرز+ كوب من الخضروات الورقية الخضراء (السبانخ والخس والبروكلي) 
•	الثلاثاء  60  غرام من كرات اللحم + كوب من المعكرونة + ½ طبق تبولة
•	الاربعاء  3 كرات لحم مع البطاطا والبروكلي والبازلاء + ½ كوب أرز + كوب من حساء العدس
•	الخميس   60  غرام من السلمون المشوي + 2 شريحة من الخبز + بطاطا مهروسة + ½ كوب سلطة طازجة
•	الجمعة  سيخان من الكباب + محشي الكوسا وأوراق العنب + سلطة الأفوكادو


وجبة خفيفة
•	السبت  كوب  من سلطة الجريب فروت والبرتقال والمشمش والبابايا
•	الاحد  موزة + كوب حليب + 10 لوزات
•	الاثنين  حفنة من الفواكه المجففة + كوب زبادي
•	الثلاثاء  كوب زبادي + 3 تمرات
•	الاربعاء  تفاحة + زبادي +  ¼ كوب من الفواكه المجففة
•	الخميس  كوب  من قطع البطيخ والبابايا
•	الجمعة  كوب  من الحليب قليل الدسم + ¼ كوب فستق

وجبة العشاء
•	السبت  بيضة مسلوقة + شريحة من الخبز البني + طبق سلطة من الخضراوات الطازجة
•	الاحد  سلطة يونانية طازجة + كوب زبادي
•	الاثنين  سلطة خضار (الخيار والجزر والفلفل الأخضر والطماطم وغيرها من الخضروات) + شريحة خبز
•	الثلاثاء  60 غرام دجاج مشوي + كوب من الخضروات المشوية (كوسا، جزر، فطر، طماطم)
•	الاربعاء  كوب حليب + شريحتان من التوست + معلقتان كبيرتان من اللبنة + شرائح الخيار والطماطم
•	الخميس  3 شرائح دجاج + كوب حساء السبانخ + شريحة خبز
•	الجمعة  سيخان من الكباب + شرائح البطاطا الحلوة + ½ كوب سلطة خضار خضراء 
''';
  static const String diets_pregnant_s3 = '''

وجبة الفطار
•	السبت  شريحة خبز + كوب من الحليب قليل الدسم + بيضة مسلوقة + ½ كوب من شرائح الخيار
•	الاحد  ½ كوب من الحبوب مع الفواكه المجففة + كوب من الحليب
•	الاثنين  ½ كوب من الشوفان المدعم + كوب من الحليب + فاكهة ( الإجاص أو التفاح )
•	الثلاثاء  2-3 قطع من الفلافل الصغيرة + شريحة خبز + 30 غرام من الجبن المبستر +½ كوب من البابايا
•	الاربعاء  شريحة خبز + بيضة مسلوقة + قطعتان من البطاطا المسلوقة + شرائح الخضروات ( الجزر والطماطم والخيار )
•	الخميس  كوب من الحبوب المعززة مع اللوز + كوب من الحليب + سلطة الأفوكادو
•	الجمعة  خبز عربي مع الزعتر أو لبنة قليلة الدهون + كوب من الحليب + 2 ثمرة تين

وجبة خفيفة
•	السبت  كوب من عصير البرتقال الطازج + 2 ثمرة تين +10 لوزات
•	الاحد  خبز عربي مع الزعتر أو لبنة قليلة الدهون + كوب زبادي
•	الاثنين   طبق من سلطة الفواكه (الموز والتين والأفوكادو)
•	الثلاثاء  حفنة  من الفواكه المجففة وبذور اليقطين + كوب زبادي
•	الاربعاء  كوب  من سلطة الجريب فروت والبرتقال والمشمش والباباي +  كوب زبادي + 10 لوزات
•	الخميس  كوب من حساء الفطر +½ طبق تبولة
•	الجمعة  طبق سلطة خضار + 3 تمرات

وجبة الغذاء
•	السبت  60  غرام من التونة الطازجة المشوية  + كوب من المكرونة المطبوخة + طبق سلطة خضار
•	الاحد  60  غرام من صدور الدجاج المشوية + كوب أرز + خضار مطهي بالبخار (بروكلي وقرنبيط )
•	الاثنين   3 كرات لحم + كوب من الفاصوليا + سلطة خضار + كوب من المعكرونة السباغيتي 
•	الثلاثاء  60  غرام من لحم البقر المشوي + كوب من الأرز البني + كوب من الخضروات المطبوخة أو السبانخ الطازجة
•	الاربعاء  60  غرام من السلمون + كوب من الخضروات المشوية   + ½ كوب سلطة الافوكادو
•	الخميس   3 كرات لحم + كوب من المعكرونة + طبق تبولة
•	الجمعة  90 غرام ستيك لحم البقر + كوب أرز + خضروات مشوية + كوب من حساء الخضار


وجبة خفيفة
•	السبت  ½ كوب حمص + شرائح الخضروات
•	الاحد  حفنة من اللوز + ¼ كوب من الفواكه المجففة
•	الاثنين  كوب من حساء السبانخ
•	الثلاثاء  كوب زبادي + ½ كوب سلطة الفواكه
•	الاربعاء  ½ كوب من الفول المطبوخ + 2 ثمرة تين
•	الخميس  سلطة الأفوكادو + كوب زبادي
•	الجمعة  طبق سلطة فواكه + زبادي


وجبة العشاء
•	السبت  طبق  من الخضروات المطهية بالبخار + زبادي
•	الاحد  طبق  من حساء الفطر مع قطع الدجاج + ¼ كوب من المكسرات غير المملحة
•	الاثنين  90 غرام ستيك من لحم البقر + طبق من الخضروات المطبوخة
•	الثلاثاء  كوب من الحليب + بيضة + شريحة خبز بني
•	الاربعاء  طبق سلطة خضار + شريحة من الخبز + زبادي
•	الخميس  طبق من حساء الخضار مع قطع الدجاج
•	الجمعة  شريحة خبز + بيضة مسلوقة + زبادي 

''';
  static const String diets_pregnant_t3 = '''

وجبة الفطار
•	السبت  ½ طبق من الحبوب المعززة بالتوت + كوب من حليب 
•	الاحد  كوب من الشوفان + كوب من الحليب + كوب من سلطة الفواكه مع المكسرات
•	الاثنين  شريحة خبز + بيضة مسلوقة + ½ كوب حمص + طماطم وخيار وشرائح الجزر
•	الثلاثاء  شريحة خبز + جبن مبستر + طبق سلطة طازجة من الخضروات الخضراء
•	الاربعاء  كوب من القمح المدعم + كوب من الحليب +حفنة من الجوز والفواكه المجففة
•	الخميس  شريحة خبز + بيضة مسلوقة + شرائح الطماطم والخيار الجزر + كوب من الحليب
•	الجمعة  توست بالقمح الكامل + ½ كوب من الفول 2-3 قطع من الفلافل الصغيرة

وجبة خفيفة
•	السبت  كوب سلطة فواكه (الجريب فروت والبرتقال وسلطة المشمش مع المكسرات) + 3 ثمرات من التين والتمر
•	الاحد  حفنتان من الجوز والكاجو وبذور اليقطين
•	الاثنين  كوب من الحليب + موزة + 2 ثمرة تين
•	الثلاثاء  كوب زبادي + ¼ كوب من التوت
•	الاربعاء  كوب من سلطة الجريب فروت والبرتقال والمشمش والبابايا + 2 ثمرة تين
•	الخميس  حفنة  من المكسرات والفواكه المجففة والبذور  
•	الجمعة  طبق من سلطة الخضار + 3 تمرات + 10 لوزات + 3 ثمرات من التين والتمر


وجبة الغذاء
•	السبت  60  غرام من صدور الدجاج + كوب من الأرز البني + طبق من حساء السبانخ + ½ طبق تبولة
•	الاحد  60  غرام من السلمون + 2 شريحة بطاطا المشوية + ½ طبق سلطة الأفوكادو
•	الاثنين   60  غرام من لحم البقر المشوي +  كوب من المعكرونة السباغيتي+ كوب من الخضار مطهي بالبخار (البروكلي والهليون والجزر والكوسا والطماطم والباذنجان)
•	الثلاثاء  60  غرام من لحم الضأن المقطّع مع الفاصوليا + كوب أرز بني + كوب حساء من الخضروات الورقية الخضراء
•	الاربعاء  60 غرام كفتة + كوب من المعكرونة والفاصوليا الحمراء + ½ طبق تبولة
•	الخميس   60  غرام من التونة الطازجة المشوية  + كوب أرز بني + كوب سلطة الخضروات
•	الجمعة    60  غرام من لحم الضأن +  كوب من المعكرونة السباغيتي + كوب من حساء الفطر


وجبة خفيفة
•	السبت  حساء الفطر والكوسا مع قطع الدجاج + ¼ كوب من المكسرات الغير  مملحة
•	الاحد  كوب سلطة خضار خضراء + كوب زبادي + 2 ثمرة تين
•	الاثنين  كوب ميلك شيك الفراولة + 3 تمرات
•	الثلاثاء  شريحة خبز + بيضة مسلوقة + شرائح الخيار
•	الاربعاء  كوب من الخضروات المشوية + حفنة من الجوز والكاجو وبذور اليقطين
•	الخميس  توست بالجبن + كوب من حساء الكوسا + 3 تمرات
•	الجمعة  كوب  من سلطة الفواكه + كوب زبادي + 10 لوزات

وجبة العشاء
•	السبت شريحة خبز + بيضة مسلوقة + + طبق سلطة من الخضراوات 
•	الاحد  ساندويش الجبن مع شرائح الطماطم + كوب من حساء الخضار
•	الاثنين  كوب سلطة يونانية طازجة + شريحة توست + زعتر مع لبنة قليلة الدهون
•	الثلاثاء  كوب من الحليب + حفنتان من الفواكه المجففة + 10 لوزات
•	الاربعاء  2 قطعة من البطاطا الحلوة + شريحة خبز + كوب من الحليب أو الزبادي
•	الخميس  طبق من السلطة الطازجة + شريحة خبز مع اللبنة
•	الجمعة  كوب من سلطة الجبن والسبانخ + شريحة خبز

''';
  static const String diets_Breastfeeding = '''
وجبة الإفطار


•	كوب كامل من الحليب، أو كوب من اللبن الرائب، أو كوب من الزبادي المنزوع الدسم الذي تمت تحليته بملعقة من العسل الأبيض.
•	مع تناول قطعة كبيرة من الجبن القريش.
•	مع حبة واحدة من البيض، ويمكن استبدالها بخمس ملاعق من الفول، مع ملعقة صغيرة من زيت الزيتون.
•	مع تناول شريحتين من التوست الأسمر.
•	يجب تناول ثمرة واحدة كبيرة من الفاكهة، أو ثمرتين كبيرتين بعد الانتهاء من تناول وجبة الإفطار بساعتين.
•	يمكن أيضًا استبدال تناول الفاكهة بكوب كبير من عصير أي نوع من أنواع الفاكهة، واحرصي على عدم تحليته.


وجبة الغداء


•	شريحتان من اللحم المشوي، أو اللحم المسلوق.
•	أو تناول نصف دجاجة، أو تناول سمكة كبيرة.
•	مع تناول ثلاث ملاعق من الأرز المسلوق، أو ثلاث ملاعق من المكرونة المسلوقة دون إضافة أي من المواد الدهنية.
•	يمكن استبدال الأرز، والمكرونة بثمرة واحدة من البطاطس المسلوقة المقطعة إلى مكعبات، أو البطاطس المهروسة، مع إضافة كمية مناسبة من البقدونس المفروم، أو الكزبرة المفرومة، مع الملح، والبهارات دون إضافة أي مواد دهنية، ويمكن إضافة ملعقة واحدة من زيت الزيتون.
•	مع تناول طبق كبير من السلطة الخضراء التي تحتوي على الخيار، والخس، والطماطم، والبصل، والبروكلي، والجرجير، والسبانخ، والكرنب البنفسجي.
•	طبق كبير من الخضار السوتيه، أو الخضار المشوي، أو طبق كبير من البقوليات دون إضافة الدهون.
•	يمكن تناول ثمرة واحدة من الفاكهة بعد الانتهاء من تناول وجبة الغداء بساعتين، وأيضًا تناول كمية قليلة من المكسرات الغير محمصة، أو مملحة.


وجبة العشاء


•	كوب كبير من اللبن الرائب خالي الدسم، أو الزبادي منزوع الدسم.
•	مع تناول قطعة كبيرة من الجبن القريش، مع إضافة ملعقة من الزعتر، وملعقة من زيت الزيتون.
•	شريحة واحدة من التوست الأسمر.
•	طبق كبير من السلطة الخضراء.
''';
  static const String diets_Breastfeeding_advice = '''
ماهي الأكلات المفيدة للأم المرضعة


تتمثل أهم الأطعمة التي يجب أن تتناولها المرأة أثناء فترة الرضاعة والتي تعد أهم عناصر جدول غذائي للأم المرضعة فيما يلي:


الأسماك للأم المرضع
•	
الأسماك من أهم الأطعنة التي يجب أن تتناولها الأم أثناء فترة الرضاعة، وخاصة سمك السلمون؛ وذلك لأنه من الأسماك الدهنية التي تحتوي على العديد من العناصر الغذائية الهامة لدعم صحتها في هذه المرحلة، كما أنها هامة لصحة الطفل الرضيع، كما أنه من المصادر الغنية بالبروتين.
•	يعمل سمك السلمون على تطوير النظام العصبي للطفل، بالإضافة إلى أنه يساعد على تحسين المزاج بصورة فعالة.
•	يعمل على وقاية الأم من الإصابة بحالة اكتئاب ما بعد الولادة.
•	كما أن الأسماك من أهم مصادر الأوميجا3 التي لها فوائد كثيرة على صحة الجسم العامة.
•	من الأفضل تناول وجبتين من الأسماك كل أسبوع.


البروتين للأم المرضع
•	يجب أن تتناول المرأة أثناء فترة الرضاعة البروتين بنسبة منتظمة، ومن الأفضل أن تتناول البروتين قليل الدهون، والتي تتمثل في الأسماك، والدجاج، والبقوليات بجميع أنواعها؛ فهي من أهم عناصر جدول غذائي للأم المرضعة.


منتجات الألبان للأم المرضع
•	ناول منتجات الألبان للأم المرضع لمرتين في اليوم من أهم العادات التي تعمل على تغذية المرأة أثناء فترة الرضاعة، وتدعم الصحة العامة لها، وللجنين؛ فهي من أهم مصادر الكالسيوم، والبروتين؛ فهي من أهم عناصر جدول غذائي للأم المرضعة.


النشويات والكربوهيدات للأم المرضع
•	
النشويات، والكربوهيدرات من الأغذية الغنية بالألياف، كما أنها تعمل على إمداد جسم الأم بالطاقة اللازمة، ومن أمثلتها الشوفان، والبرغل، والتوست الأسمر؛ فهي من أهم عناصر جدول غذائي للأم المرضعة.


الخضروات والفاكهة للأم المرضع
•	
يجب أن تتناول المرأة ما لا يقل عن خمس وجبات خفيفة من الفاكهة، والخضروات أثناء اليوم خلال فترة الرضاعة؛ فالفاكهة، والخضروات من أكثر المغذيات الغنية بالفيتامينات، والمعادن التي يحتاجها جسم الأم، وجسم الطفل؛ فيمكنها أن تمده بأهم العناصر اللازمة لنموه الصحي؛ فهي من أهم lactating mother feeding.


السوائل اثناء فترة الرضاعة
•  السوائل من أهم الأغذية التي يجب أن تتناولها الأم خلال فترة الرضاعة؛ وذلك لأنها تعمل على ترطيب الجسم بشكل فعال، فمن الضروري تناول المشروبات الساخنة، والعصائر الطازجة، والمياه؛ فهي من أهم عناصر جدول غذائي للأم المرضعة.
•  يجب أن تتناول الأم السوائل طوال اليوم بصورة منتظمة؛ فهي تساعد على إمدادها بالطاقة، وتحتوي على العناصر الغذائية التي تساعد الطفل على النمو سواء كانت هذه المشروبات من العصائر الطازجة، أو من الأعشاب الساخنة.

''';
  static const String weight_pi = '''

وجبة الفطار
•	اليوم الاول مربي لايت + 2 شريحة توست سن
•	اليوم الثاني  وجبة غير محددة النوع ولكن بكمية محددة مثل 1 فول + 1 طعمية
•	اليوم الثالث  قطعة من الجبن القريش + توست سن
•	اليوم الرابع  2 بيضة مسلوقة أو مقلية أو جبن أبيض + نصف رغيف بلدي
•	اليوم الخامس فول بدون زيت + خيار + عيش سن
•	اليوم السادس  نصف رغيف بلدي + طبق فول متوسط بملعقة من الزيت

وجبة الغذاء
•	اليوم الاول قطعة من اللحم الأحمر + 4 ملاعق أرز أو خبز + سلطة خضار
•	اليوم الثاني لحوم بيضاء مثل الدجاج أو السمك + طبق خضروات + سلطة + قطعة حلويات 40 جرام ( بعد الغذاء ب 3 ساعات )
•	اليوم الثالث جمبري + سمك + أرز + سلطة
•	اليوم الرابع لحوم بدون بقسماط + طبق خضروات + نشويات اي نوع
•	اليوم الخامس شوربة عدس + بصارة + رغيف بلدي + بصل + خيار + سلطة
•	اليوم السادس  نوع لحوم 100 جرام + طبق خضروات متوسط + نصف رغيف بلدي

وجبة العشاء
•	اليوم الاول اي نوع جبنة لايت + فاكهة
•	اليوم الثاني بيض مطهو باي طريقة + جبن + طبق سلطة أو خضروات نصف مطهية
•	اليوم الثالث 3 ثمرات من الفاكهة
•	اليوم الرابع جبن اي نوع ماعدا الكيري أو النستو + نصف رغيف بلدي + سلطة
•	اليوم الخامس  فاكهة
•	اليوم السادس قطعة جبن متوسطة الحجم  + نصف رغيف بلدي

''';
}
